matchai/spacefish
edc/bass
jethrokuan/z
fisherman/fzf
fisherman/fzy
fisherman/rbenv
fisherman/pyenv
fisherman/gitignore
joseluisq/gitnow
laughedelic/brew-completions
