matchai/spacefish
edc/bass
fisherman/fzf
fisherman/fzy
fisherman/gitignore
joseluisq/gitnow
laughedelic/brew-completions
jorgebucaran/fish-bax
