cask_args appdir: "/Applications"

tap "buo/cask-upgrade"

# Security
cask "avast-security"
cask "1password"
cask "1password-cli"
cask "reikey"
cask "lulu"
cask "taskexplorer"
cask "knockknock"
cask "oversight"
cask "whatsyoursign"
cask "adguard"

# Window management
cask "finderminder"
cask "moom"
cask "witch"
cask "contexts"
cask "mission-control-plus"

# Everything VM related
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "vagrant-manager"

# Web browsers
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefox-developer-edition"
cask "safari-technology-preview"

# Core development
cask "alfred"
cask "iterm2"
cask "codekit"
cask "dash"
cask "datagrip"
cask "emacs"

# IDEs
cask "webstorm"
cask "visual-studio-code"
cask "intellij-idea"

# File/directory management
cask "path-finder"
cask "osxfuse"
brew "ext4fuse"
cask "filepane"
cask "keka"

# VCS related
cask "sublime-merge"
cask "tower"

# Networking
cask "ngrok"

# Mac OS management
cask "latest"
cask "gas-mask"
cask "endurance"
cask "bettertouchtool"
cask "switchresx"

# Music players
cask "macmediakeyforwarder"

# Office
cask "microsoft-office"

# Install developer friendly quick look plugins
# see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Misc.
cask "pixelsnap"
cask "cleanshot"
