cask_args appdir: "/Applications"

tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# Security
cask "avast-security"
cask "1password"
cask "1password-cli"
cask "adguard"
cask "nordvpn"

# Window management
cask "moom"
cask "witch"
cask "mission-control-plus"

# Everything VM related
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "docker"

# Web browsers
cask "google-chrome"
cask "firefox"

# Core development
cask "iterm2"
cask "dash"
cask "insomnia"

# IDEs
cask "webstorm"
cask "visual-studio-code"
cask "intellij-idea"

# File/directory management
cask "osxfuse"
brew "ext4fuse"
cask "filepane"
cask "default-folder-x"

# VCS related
cask "sublime-merge"

# Networking
cask "ngrok"

# Mac OS management
cask "setapp"
cask "latest"
cask "endurance"
cask "bettertouchtool"
cask "haptic-touch-bar"
cask "switchresx"
cask "appcleaner"
cask "bartender"
cask "muzzle"
cask "switchresx"
cask "browserosaurus"
cask "jettison"
cask "alfred"

# Media players
cask "macmediakeyforwarder"
cask "iina"

# Backups
cask "backblaze"
cask "imazing"

# Sync Services
cask "dropbox"
cask "google-backup-and-sync"

# Office
cask "microsoft-office"
cask "pdf-expert"

# Install developer friendly quick look plugins
# see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Fonts
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font-mono"

# Misc.
cask "cleanshot"
cask "rocket"
