cask_args appdir: "/Applications"

tap "homebrew/versions"
tap "bramstein/webfonttools"
tap "buo/cask-upgrade"

# Install other useful binaries.
brew "screen"
brew "ack"
brew "dark-mode"
brew "htop-osx", args: ["with-ncurses"]
brew "googler"
brew "buku"
brew "exa"
brew "shellcheck"
brew "yarn", args: ["without-node"]
brew "m-cli"

# image processing
brew "webkit2png"
brew "zopfli"
brew "pngcrush"
brew "imagemagick", args: ["with-webp"]

# VCS related
brew "git"
brew "git-lfs"
brew "git-flow"
brew "git-extras"
brew "hub"
brew "gitsh"

# file/directory management
brew "fzf"
brew "fzy"
brew "z"
brew "goto"
brew "bat"
cask "osxfuse"
brew "ext4fuse"

# compression utilities
brew "p7zip"
brew "pigz"
brew "unrar"
brew "xz"

# Lxml and Libxslt
brew "libxml2"
brew "libxslt"

# core development casks
cask "alfred"
cask "iterm2"
cask "hyper"
cask "codekit"
cask "tower"
cask "dash"
cask "imageoptim"

# web browsers
cask "google-chrome"
cask "google-chrome-canary"
cask "firefox"
cask "firefox-developer-edition"

# database management
cask "sequel-pro"
cask "psequel"
cask "pgadmin4"

# Everything VM related
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "vagrant-manager"
brew "docker"
brew "boot2docker"

# Window management
cask "tuck"
cask "finderminder"
cask "moom"
cask "witch"

# Security
cask "avast-security"
cask "1password"
cask "1password-cli"
cask "bitwarden"
brew "bitwarden-cli"
brew "wifi-password"
cask "reikey"
cask "lulu"
cask "taskexplorer"
cask "do-not-disturb"
cask "knockknock"
cask "oversight"
cask "whatsyoursign"
cask "outline"
cask "outline-manager"

# Install developer friendly quick look plugins; see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Mac App Store applications
# Example:
# mas "The Unarchiver", id: 425424353
brew "mas"
mas "1026349850" # Copied
mas "449830122" # HyperDock
mas "880001334" # Reeder"
mas "918858936" # Airmail
mas "969418666" # ColorSnapper2
mas "402989379" # iStudiez Pro
mas "736189492" # Notability
mas "1082624744" # Gifox
mas "585829637" # Todoist"
mas "1130783329" # Archiver 3
mas "1419224245" # Canopy
mas "924726344" # Deliveries
mas "639968404" # Parcel
mas "937984704" # Amphetamine
mas "1354319581" # Core Shell
mas "1354318707" # Core Tunnel
mas "993487541" # CARROT Weather
mas "441258766" # Magnet
mas "1191449274" # ToothFairy
mas "1006087419" # SnippetsLab
mas "568494494" # Pocket
mas "553245401" # Friendly Streaming
mas "1152443474" # Squash
mas "445189367" # PopClip
mas "668429425" # Downcast
mas "975937182" # Fantastical 2
mas "411643860" # DaisyDisk
mas "405399194# # Kindle
mas "457622435" # Yoink
mas "915542151" # Monity
mas "430798174" # HazeOver
mas "897118787" # Shazam
mas "1292198261" # iMazing HEIC Converter

# misc.
brew "tmux"
brew "tmuxinator-completions"
brew "the_silver_searcher"
brew "lua"
brew "pv"
brew "rename"
brew "speedtest_cli"
brew "ssh-copy-id"
brew "tree"
brew "pandoc"
brew "httpie"
brew "reattach-to-user-namespace"
brew "thefuck"
brew "asciinema"
brew "hh"
brew "ripgrep"
brew "peco"
brew "tig"
brew "asdf"
brew "wallpaper"
brew "task"
brew "taskd"
brew "tasksh"
brew "cmus"
brew "most"
brew "ripgrep"
brew "travis"
brew "sebglazebrook/aliases/aliases"
brew "autoenv"
brew "autojump"
brew "jump"
brew "borg"
brew "emojify"
brew "ansiweather"
brew "piknik"
cask "ngrok"
brew "micro"
brew "blacktop/tap/lporg"
