cask_args appdir: "/Applications"

tap "homebrew/versions"
tap "bramstein/webfonttools"
tap "buo/cask-upgrade"

# Install other useful binaries.
brew "screen"
brew "ack"
brew "dark-mode"
brew "htop-osx", args: ["with-ncurses"]
brew "googler"
brew "buku"
brew "exa"
brew "shellcheck"
brew "yarn", args: ["without-node"]
brew "m-cli"

# image processing
brew "webkit2png"
brew "zopfli"
brew "pngcrush"
brew "imagemagick", args: ["with-webp"]

# VCS related
brew "git"
brew "git-lfs"
brew "git-flow"
brew "git-extras"
brew "hub"
brew "gitsh"

# file/directory management
brew "fzf"
brew "fzy"
brew "z"
brew "goto"
brew "bat"
cask "osxfuse"
brew "ext4fuse"

# compression utilities
brew "p7zip"
brew "pigz"
brew "unrar"
brew "xz"

# Lxml and Libxslt
brew "libxml2"
brew "libxslt"

# misc.
brew "tmux"
brew "tmuxinator-completions"
brew "the_silver_searcher"
brew "lua"
brew "pv"
brew "rename"
brew "speedtest_cli"
brew "ssh-copy-id"
brew "tree"
brew "pandoc"
brew "httpie"
brew "reattach-to-user-namespace"
brew "thefuck"
brew "asciinema"
brew "wifi-password"
brew "hh"
brew "ripgrep"
brew "peco"
brew "tig"
brew "asdf"
brew "wallpaper"
brew "task"
brew "taskd"
brew "tasksh"
brew "cmus"
brew "most"
brew "ripgrep"
brew "travis"
brew "sebglazebrook/aliases/aliases"
brew "autoenv"
brew "autojump"
brew "jump"
brew "borg"
brew "emojify"
brew "ansiweather"
brew "piknik"
cask "ngrok"
brew "micro"

# core development casks
cask "alfred"
cask "iterm2"
cask "hyper"
cask "codekit"
cask "tower"
cask "dash"
cask "imageoptim"

# web browsers
cask "google-chrome"
cask "firefox"

# database management
cask "sequel-pro"
cask "psequel"
cask "pgadmin4"

# Everything VM related
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "vagrant-manager"
brew "docker"
brew "boot2docker"

# Install developer friendly quick look plugins; see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Mac App Store applications
# Example:
# mas "The Unarchiver", id: 425424353
brew "mas"
