cask_args appdir: "/Applications"

tap "homebrew/versions"
tap "bramstein/webfonttools"

brew "coreutils"

# Install some other useful utilities like `sponge`.
brew "moreutils"

# Install GNU `find`, `locate`, `updatedb`, and `xargs`
brew "findutils"

# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed"

# Install `wget` with IRI support.
brew "wget", args: ["with-iri"]

# Install more recent versions of some OS X tools.
brew "vim", args: ["override-system-vi"]

# Install other useful binaries.
brew "screen"
brew "ack"
brew "dark-mode"
brew "htop-osx", args: ["with-ncurses"]

# image processing
brew "webkit2png"
brew "zopfli"
brew "pngcrush"
brew "imagemagick", args: ["with-webp"]

# VCS related
brew "git"
brew "git-lfs"
brew "hub"
brew "gitsh"

# file/directory management
brew "fzf"
brew "fzy"
brew "z"
brew "goto"

# compression utilities
brew "p7zip"
brew "pigz"
brew "unrar"
brew "xz"

# Lxml and Libxslt
brew "libxml2"
brew "libxslt"

# misc.
brew "lua"
brew "pv"
brew "rename"
brew "speedtest_cli"
brew "ssh-copy-id"
brew "tree"
brew "pandoc"
brew "httpie"
brew "reattach-to-user-namespace"
brew "thefuck"
brew "asciinema"
brew "wifi-password"

# core development casks
cask "alfred"
cask "iterm2"
cask "codekit"
cask "tower"
cask "dash"
cask "imageoptim"

# web browsers
cask "google-chrome"
cask "firefox"

# database management
cask "sequel-pro"
cask "psequel"
cask "pgadmin4"

# Everything VM related
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vagrant"
cask "vagrant-manager"
brew "docker"
brew "boot2docker"

# Install developer friendly quick look plugins; see https://github.com/sindresorhus/quick-look-plugins
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"
cask "quicklook-json"
cask "qlimagesize"
cask "webpquicklook"
cask "suspicious-package"
cask "quicklookase"
cask "qlvideo"

# Mac App Store applications
# Example:
# mas "The Unarchiver", id: 425424353
brew "mas"