tap "bramstein/webfonttools"
tap "github/gh"

# Mac OS management
brew "m-cli"
brew "dark-mode"
brew "wallpaper"
brew "blacktop/tap/lporg"

# Image processing
brew "webkit2png"
brew "zopfli"
brew "pngcrush"
brew "imagemagick"

# VCS related
brew "git"
brew "git-lfs"
brew "git-flow"
brew "git-extras"
brew "hub"
brew "gitsh"
brew "tig"
brew "github/gh/gh"

# File/directory management
brew "ranger"
brew "fzf"
brew "fzy"
brew "z"
brew "goto"
brew "autojump"
brew "jump"
brew "bat"
brew "tree"
brew "rename"
brew "piknik"
brew "dropbox-uploader"
brew "fd"

# Compression utilities
brew "p7zip"
brew "pigz"
brew "unrar"
brew "xz"

# Core development
brew "travis"

# Everything VM related
brew "docker"
brew "boot2docker"

# Terminal multiplexing
brew "tmux"
brew "reattach-to-user-namespace"

# Networking
brew "speedtest_cli"
brew "httpie"
brew "ssh-copy-id"
brew "pv"

# Process management
brew "htop-osx"

# Music players
brew "cmus"

# Security
brew "wifi-password"
brew "maliceio/tap/malice"

# Install other useful binaries.
brew "thefuck"
brew "the_silver_searcher"
brew "asciinema"
brew "sebglazebrook/aliases/aliases"
brew "screen"
brew "ack"
brew "buku"
brew "exa"
brew "shellcheck"
brew "micro"
brew "pandoc"
brew "emojify"
brew "ansiweather"
brew "googler"
brew "hh"
brew "entr"
brew "ccat"
brew "percol"
brew "peco"
brew "emacs-dracula"
brew "starship"
